# Спроектируйте электрический чайник.

# Внутри чайника есть микрокомпьютер, ему доступны и уже реализованы доступы ко всем необходимым датчикам и управляющим элементам. Человек нажал кнопку, программа должна правильно и безопасно вскипятить воду.

# Ваша задача спроектировать такую программу. Представьте, как вы будете писать такую программу. Какие у неё будут объекты/классы, а у классов методы?

# Саму программу писать не нужно! Только названия классов и их методы. Как кубики в конструкторе LEGO.

# Будьте внимательны к названиям: класс это всегда существительное в единственном числе именительном падеже, а метод — обычно глагол инфинитив ("включить_музыку", "купить_хлеб"...) или существительное-свойство ("цвет", "скорость"...)

# Результат: от руки нарисованный (лучше маркером или фломастером на листе А4) набор классов вашей программы и список методов каждого класса.

# Никакой код в задаче писать не нужно.

# Подсказка
# Задание творческое, смысл — научиться разбивать сложный объект и его поведение на простые составляющие и процессы. Исходя из поставленной задачи.

# Принципиальные существенные элементы чайника (наша версия):

# * нагревательный элемент
# * элемент управления (кнопка включения нагрева)
# * индикатор текущей температуры
# * датчик температуры
# Придумайте, какие методы есть у каждого из этих элементов, если ими пользоваться в коде как руби объектами.